src/cf/InformationRegisters/обм_КОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>обм_КОтправке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагОшибкиОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ИсходящиеСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/обм_ИсходящиеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>обм_ИсходящиеСообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелОтправительИсточника</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагОшибкиПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/обм_КОтправке/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеДиалогом();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗапросом(Команда)
	
	// Это шаблон текста для подстановки в поле ввода, а не запрос
	// Поэтому не разбирается конструктором
	текстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1 Ссылка ИЗ "; // BSLLS:QueryParseError-off
	
	оповещениеОВводе = Новый ОписаниеОповещения("ДобавитьЗапросом_ЗавершениеВводаТекстаЗапроса", ЭтотОбъект);
	ПоказатьВводЗначения(оповещениеОВводе, текстЗапроса, "Введите текст запроса", Тип("Строка"));
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДобавитьЗапросом_ЗавершениеВводаТекстаЗапроса(пТекстЗапроса, ДопПараметры = Неопределено) Экспорт
	
	Если ПустаяСтрока(пТекстЗапроса) Тогда
		Возврат;
		
	КонецЕсли;

	ДобавитьЗапросомНаСервере(пТекстЗапроса);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ДобавитьЗапросомНаСервере(Знач пТекстЗапроса)
	
	запрос = Новый Запрос;
	запрос.Текст = пТекстЗапроса;
	выборка = Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		Справочники.обм_ИсходящиеСообщения.СоздатьПоСсылкеИсточника(выборка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПослание(Команда)
	
	ключиРегистра = Элементы.Список.ВыделенныеСтроки; 
	
	Если ключиРегистра.Количество() = 0 Тогда
		Возврат;
		
	КонецЕсли;

	ОтправитьПосланиеНаСервере(ключиРегистра);
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПосланиеИУдалитьРегистрацию(Команда)
	
	ключиРегистра = Элементы.Список.ВыделенныеСтроки; 
	
	Если ключиРегистра.Количество() = 0 Тогда
		Возврат;
		
	КонецЕсли;
	
	удалитьРегистрацию = Истина;
	ОтправитьПосланиеНаСервере(ключиРегистра, удалитьРегистрацию);
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьПосланиеНаСервере(Знач пКлючиРегистра, Знач пУдалитьРегистрацию = Ложь)
	
	Для Каждого ключ Из пКлючиРегистра Цикл
		результат = РегистрыСведений.обм_КОтправке.ИсходящееСообщение_Отправить(ключ.ИсходящееСообщение,
				ключ.Узел, ключ.ОбработчикОтправки		);
		
		Если НЕ ПустаяСтрока(результат) Тогда
			пользователю = Новый СообщениеПользователю;
			пользователю.Текст = СокрЛП(ключ.ИсходящееСообщение) + ": " + СокрЛП(результат);
			пользователю.Сообщить();
			
		КонецЕсли;
		
		Если пУдалитьРегистрацию Тогда
			РегистрыСведений.обм_КОтправке.УдалитьРегистрацию(ключ.ИсходящееСообщение,
					ключ.Узел, ключ.ОбработчикОтправки		);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРегламентное(Команда)
	
	ПереключитьРегламентноеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПереключитьРегламентноеНаСервере()
	
	имяЗадания = Метаданные.РегламентныеЗадания.обм_Отправка_2_ИсходящиеСообщения_Отправить.Имя;
	использование = Обработки.обм_Дашборд.Регламентное_Использование(имяЗадания);
	Обработки.обм_Дашборд.Регламентное_Использование_Установить(имяЗадания, Не использование);
	
	УправлениеДиалогом();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРазмерОчереди(Команда)
	
	ОбновитьЗаголовокОчередиНаСервере(Формат(ТекущаяДата(), "ДФ=HH:mm:ss")); // BSLLS:DeprecatedCurrentDate-off
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокОчередиНаСервере(Знач пВремя = "")
	
	Если ПустаяСтрока(пВремя) Тогда
		пВремя = Формат(ТекущаяДатаСеанса(), "ДФ=HH:mm:ss");
		
	КонецЕсли;
	
	состояние = Обработки.обм_Дашборд.Очередь_Состояние("КОтправке");
	счётчик = Обработки.обм_Дашборд.Очередь_ТекстСчётчика(состояние.Остаток, состояние.Ошибки);
	Элементы.ПоказатьРазмерОчереди.Заголовок = СтрШаблон(
		"%1 Остаток %2. Нажмите здесь чтобы пересчитать",
		пВремя,
		счётчик);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсеНаСервере()
	РегистрыСведений.обм_КОтправке.УдалитьВсе();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	УдалитьВсеНаСервере(); 
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеДиалогом()
	
	Если Элементы.Список.Видимость Тогда
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
	Если Элементы.ФормаПереключитьРегламентное.Видимость Тогда
		использование = Обработки.обм_Дашборд.Регламентное_Использование(
			Метаданные.РегламентныеЗадания.обм_Отправка_2_ИсходящиеСообщения_Отправить.Имя);
		
		заголовокКнопки = Неопределено;
		картинкаКнопки = Неопределено;
		Если использование Тогда
			заголовокКнопки = "Задание работает";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругЗеленый;
			
		Иначе
			заголовокКнопки = "Задание отключено";
			картинкаКнопки = БиблиотекаКартинок.ОформлениеКругПустой;
			
		КонецЕсли;
		
		Элементы.ФормаПереключитьРегламентное.Заголовок = заголовокКнопки;
		Элементы.ФормаПереключитьРегламентное.Картинка = картинкаКнопки;
		
	КонецЕсли;
	
	ОбновитьЗаголовокОчередиНаСервере();
	
КонецПроцедуры

#КонецОбласти
